tap "homebrew/core"
tap "homebrew/cask"
tap "homebrew/bundle"
tap "homebrew/services"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "graalvm/tap"
tap "spring-io/tap"
tap "buildpacks/tap"
tap "maciejwalkowiak/brew"
tap "1password/tap"

#### DEVELOPMENT ####
# All in one for **env
# https://anyenv.github.io/
brew "anyenv"
brew "btop"
# Top-like interface for container metrics
# https://bcicen.github.io/ctop/
brew "ctop"
# Tool for exploring each layer in a docker image
# https://github.com/wagoodman/dive
brew "dive"
# GitHub command-line tool
# https://github.com/cli/cli
brew "gh"
# Distributed revision control system
# https://git-scm.com
brew "git"
# GNU Pretty Good Privacy (PGP) package. Formerly known as: gnupg2.
# Also known as: gnupg2, gnupg@2.3, gpg, gpg2
# https://gnupg.org
brew "gnupg"
# Open-source build automation tool based on the Groovy and Kotlin DSL
# https://www.gradle.org/
brew "gradle"
# Java-based scripting language
# https://www.groovy-lang.org/
brew "groovy"
# User-friendly cURL replacement (command-line HTTP client)
# https://httpie.io/
brew "httpie"
# Generate, develop and deploy Spring Boot + Angular/React applications
# https://www.jhipster.tech/
brew "jhipster"
brew "jmeter"
# just is a handy way to save and run project-specific commands.
# https://github.com/casey/just
brew "just"
# Statically typed programming language for the JVM
# https://kotlinlang.org/
brew "kotlin"
# Also known as: kubectl, kubectl@1.24, kubernetes-cli@1.24
# https://kubernetes.io/
brew "kubectl"
# Java-based project management
# https://maven.apache.org/
brew "maven"
# Run a Kubernetes cluster locally
# https://minikube.sigs.k8s.io/
brew "minikube"
# Development kit for the Java programming language
# https://openjdk.java.net/
brew "openjdk"
brew "openjdk@8"
brew "openjdk@11"
brew "openjdk@17"
# Cryptography and SSL/TLS Toolkit
# https://openssl.org/
brew "openssl@1.1"
# Pack is a tool maintained by the Cloud Native Buildpacks project to support the use of buildpacks.
# https://buildpacks.io/docs/tools/pack/
brew "pack"
# General-purpose scripting language
# https://www.php.net/
brew "php"
# Pinentry for GPG on Mac
# https://github.com/GPGTools/pinentry
brew "pinentry-mac"
# Postgres C API library
# https://www.postgresql.org/docs/15/libpq.html
brew "libpq"
# The Spring Boot CLI is a command line tool that you can 
# use if you want to quickly develop a Spring application
# https://docs.spring.io/spring-boot/docs/2.7.x/reference/html/cli.html#cli
brew "spring-boot"
# Version control system designed to be a better CVS
# https://subversion.apache.org/
brew "subversion"
# Very fast implementation of tldr in Rust
# https://github.com/dbrgn/tealdeer
brew "tealdeer"
# Terminal multiplexer
# https://tmux.github.io/
brew "tmux"
# JavaScript package manager
# https://yarnpkg.com/
brew "yarn"

#### TERMINAL APPS ####
# Simple macOS CLI to connect/disconnect a Bluetooth device. 
# https://github.com/lapfelix/BluetoothConnector
brew "bluetoothconnector"
# Music player with an ncurses based interface
# https://cmus.github.io/
brew "cmus"
brew "coreutils"
# Installed for omz plugin :: zsh-interactive-cd ::
# Command-line fuzzy finder written in Go
# https://github.com/junegunn/fzf
brew "fzf"
# Terminal JSON viewer
# https://fx.wtf
brew "fx"
# Lightweight and flexible command-line JSON processor
# https://stedolan.github.io/jq/
brew "jq"
brew "htop"
# GNU multiple precision arithmetic library
# https://gmplib.org/
brew "gmp"
# Tools and libraries to manipulate images in many formats
# https://imagemagick.org/index.php
brew "imagemagick"
# Kubernetes CLI To Manage Your Clusters In Style!
# https://k9scli.io/
brew "k9s"
brew "kubectl"
# YAML Parser
# https://github.com/yaml/libyaml
brew "libyaml"
# Keep your application settings in sync (OS X/Linux)
# https://github.com/lra/mackup
brew "mackup"
# Mac App Store command-line interface
# https://github.com/mas-cli/mas
brew "mas"
brew "midnight-commander"
brew "minikube"
# Fast, highly customisable system info script
# https://github.com/dylanaraps/neofetch
brew "neofetch"
# Also known as: openssl
# Cryptography and SSL/TLS Toolkit
# https://openssl.org/
brew "openssl@3"
# Emulator for x86 and PowerPC
# https://www.qemu.org
brew "qemu"
# Command-line interface for https://speedtest.net bandwidth tests
# https://github.com/sivel/speedtest-cli
brew "speedtest-cli"
# CLI tool that moves files or folder to the trash
# https://hasseg.org/trash/
brew "trash"
# Display directories as trees (with optional color/HTML output)
# http://mama.indstate.edu/users/ice/tree/
brew "tree"
# Ambitious Vim-fork focused on extensibility and agility
# https://neovim.io/
brew "neovim"
# Library for command-line editing
# https://tiswww.case.edu/php/chet/readline/rltop.html
brew "readline"
# YAML syntax highlighter to bring colours where only jq could
# https://github.com/andreazorzetto/yh
brew "yh"
# Fish-like fast/unobtrusive autosuggestions for zsh
# https://github.com/zsh-users/zsh-autosuggestions
brew "zsh-autosuggestions"
# Fish shell like syntax highlighting for zsh
# https://github.com/zsh-users/zsh-syntax-highlighting
brew "zsh-syntax-highlighting"

#### Casks ####
cask "1password"
cask "1password-cli"
cask "adguard"
cask "alfred"
cask "anydesk"
cask "appcleaner"
cask "brewservicesmenubar"
cask "browserosaurus"
cask "cleanshot"
# AWS Corretto JDK
# https://corretto.aws/
cask "corretto"
cask "corretto8"
cask "corretto11"
cask "corretto17"
cask "discord"
# Pack, ship and run any application as a lightweight container
# https://www.docker.com/
cask "docker"
cask "drawio"
# Eclipse IDE for Java EE developers
# https://eclipse.org/
cask "eclipse-jee"
cask "firefox"
# Flip clock screensaver
# https://fliqlo.com/
cask "fliqlo"
# Download manager with a torrent client
# https://mac.eltima.com/download-manager.html
cask "folx"
cask "fork"
cask "gimp"
cask "google-chrome"
# GraalVM High Performance. Cloud Native. Polyglot.
# https://www.graalvm.org
cask "graalvm-ce-java8"
cask "graalvm-ce-java11"
cask "graalvm-ce-java17"
cask "graalvm-ce-java19"
cask "iterm2"
cask "jetbrains-toolbox"
cask "keka"
cask "keystore-explorer"
# Clipboard manager
# https://maccy.app/
cask "messenger"
# Development environment, tooling platform and application framework
# https://netbeans.apache.org/
cask "netbeans"
cask "notion"
cask "obsidian"
cask "openvpn-connect"
cask "postman"
# GUI for streamlined Redis application development
# https://redis.com/redis-enterprise/redis-insight/
cask "redisinsight"
# Move and resize windows using keyboard shortcuts or snap areas
# https://rectangleapp.com/
cask "rectangle"
cask "signal"
cask "slack"
cask "spotify"
# Next generation tooling for Spring Boot
# https://spring.io/tools
cask "springtoolsuite"
cask "sublime-text"
cask "telegram"
cask "thingsmacsandboxhelper"
cask "tower"
# Virtual machines UI using QEMU
# https://getutm.app/
cask "utm"
cask "vanilla"
cask "visual-studio-code"
cask "visualvm"
cask "vlc"
cask "zoom"

#### Quicklook ####
cask "qlcolorcode"
cask "qlstephen"
cask "qlmarkdown"
cask "quicklook-json"
cask "qlimagesize"
cask "suspicious-package"
cask "apparency"
cask "quicklookase"
cask "qlvideo"
cask "WebPQuickLook"

#### Fonts ####
cask "font-fira-code"
cask "font-fira-mono"
cask "font-fira-mono-for-powerline"
cask "font-meslo-lg"
cask "font-meslo-lg-dz"
cask "font-jetbrains-mono"
# nerd fonts
cask "font-fira-code-nerd-font"
cask "font-meslo-lg-nerd-font"
cask "font-jetbrains-mono-nerd-font"

#### Use corresponding docker images ####
# Apache Cassandra is an open source NoSQL distributed database
# https://cassandra.apache.org/_/index.html
#brew "cassandra"
# Brew tap for postgreSQL
#tap "petere/postgresql"
# Object-relational database system
# https://www.postgresql.org/rb
#brew "postgresql", restart_service: true
# Persistent key-value database, with built-in net interface
# https://redis.io/
#brew "redis"
# Brew tap for mongoDB
#tap "mongodb/brew"
# MongoDB is a source-available cross-platform document-oriented database program.
# https://docs.mongodb.com/manual/
#brew "mongodb/brew/mongodb-community"
# mongodb-compass Explore and manipulate your MongoDB data
# https://www.mongodb.com/products/compass
#cask "mongodb-compass"
# Open source relational database management system
# https://dev.mysql.com/doc/refman/8.0/en/
#brew "mysql", restart_service: true
# Visual tool to design, develop and administer MySQL servers
# https://www.mysql.com/products/workbench/
#cask "mysqlworkbench"

#### Mac App Store ####
mas "1Password for Safari", id: 1569813296
mas "Amphetamine", id: 937984704
mas "AudioBookBinder", id: 413969927
mas "Battery Health 2", id: 1120214373
mas "CleanMyDrive 2", id: 523620159
mas "Dato", id: 1470584107
mas "Keynote", id: 409183694
mas "Magnet", id: 441258766
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "pomodorome", id: 1484801884
mas "ScreenBrush", id: 1233965871
mas "Spark", id: 1176895641
mas "Startup Disk Full Fixer", id: 1346655838
mas "Things", id: 904280696
mas "Trello", id: 1278508951
mas "Xcode", id: 497799835

#### Testing ####
# Brew
# Mas