tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "buo/cask-upgrade"
tap "mongodb/brew"
tap "petere/postgresql"
tap "spring-io/tap"


#### DEVELOPMENT ####
# Apache Cassandra is an open source NoSQL distributed database
# https://cassandra.apache.org/_/index.html
brew "cassandra"
# AWS Corretto JDK
# https://corretto.aws/
cask "corretto"
cask "corretto8"
cask "corretto11"
cask "corretto17"
# Top-like interface for container metrics
# https://bcicen.github.io/ctop/
brew "ctop"
# Tool for exploring each layer in a docker image
# https://github.com/wagoodman/dive
brew "dive"
# Pack, ship and run any application as a lightweight container
# https://www.docker.com/
cask "docker"
# Eclipse IDE for Java EE developers
# https://eclipse.org/
cask "eclipse-jee"
# GitHub command-line tool
# https://github.com/cli/cli
brew "gh"
# Distributed revision control system
# https://git-scm.com
brew "git"
# GNU Pretty Good Privacy (PGP) package. Formerly known as: gnupg2.
# Also known as: gnupg2, gnupg@2.3, gpg, gpg2
# https://gnupg.org
brew "gnupg"
# Open-source build automation tool based on the Groovy and Kotlin DSL
# https://www.gradle.org/
brew "gradle"
# Java-based scripting language
# https://www.groovy-lang.org/
brew "groovy"
# User-friendly cURL replacement (command-line HTTP client)
# https://httpie.io/
brew "httpie"
# Manage your Java environment
# https://www.jenv.be/
brew "jenv"
# Generate, develop and deploy Spring Boot + Angular/React applications
# https://www.jhipster.tech/
brew "jhipster"
# Statically typed programming language for the JVM
# https://kotlinlang.org/
brew "kotlin"
# Also known as: kubectl, kubectl@1.24, kubernetes-cli@1.24
# https://kubernetes.io/
brew "kubectl"
# Java-based project management
# https://maven.apache.org/
brew "maven"
# Run a Kubernetes cluster locally
# https://minikube.sigs.k8s.io/
brew "minikube"
# MongoDB is a source-available cross-platform document-oriented database program. 
# https://docs.mongodb.com/manual/
brew "mongodb/brew/mongodb-community"
# Open source relational database management system
# https://dev.mysql.com/doc/refman/8.0/en/
brew "mysql", restart_service: true
# Visual tool to design, develop and administer MySQL servers
# https://www.mysql.com/products/workbench/
cask "mysqlworkbench"
# Development environment, tooling platform and application framework
# https://netbeans.apache.org/
cask "netbeans"
# Manage multiple Node.js versions
# https://github.com/nvm-sh/nvm
brew "nvm"
# Development kit for the Java programming language
# https://openjdk.java.net/
brew "openjdk"
brew "openjdk@8"
brew "openjdk@11"
brew "openjdk@17"
# Cryptography and SSL/TLS Toolkit
# https://openssl.org/
brew "openssl@1.1"
# General-purpose scripting language
# https://www.php.net/
brew "php"
# Pinentry for GPG on Mac
# https://github.com/GPGTools/pinentry
brew "pinentry-mac"
# Object-relational database system
# https://www.postgresql.org/
brew "postgresql", restart_service: true
# Framework for managing multi-language pre-commit hooks
# https://pre-commit.com/
brew "pre-commit"
# Persistent key-value database, with built-in net interface
# https://redis.io/
brew "redis"
# Ruby environment
brew "rbenv"
brew "rbenv-vars"
brew "rbenv-gemset"
brew "ruby-build"
# The Spring Boot CLI is a command line tool that you can 
# use if you want to quickly develop a Spring application
# https://docs.spring.io/spring-boot/docs/2.7.x/reference/html/cli.html#cli
brew "spring-boot"
# Next generation tooling for Spring Boot
# https://spring.io/tools
cask "springtoolsuite"
cask "sublime-text"
# Version control system designed to be a better CVS
# https://subversion.apache.org/
brew "subversion"
# Very fast implementation of tldr in Rust
# https://github.com/dbrgn/tealdeer
brew "tealdeer"
# Terminal multiplexer
# https://tmux.github.io/
brew "tmux"
# JavaScript package manager
# https://yarnpkg.com/
brew "yarn"


#### TERMINAL APPS ####

# Simple macOS CLI to connect/disconnect a Bluetooth device. 
# https://github.com/lapfelix/BluetoothConnector
brew "bluetoothconnector"
# Installed for omz plugin :: zsh-interactive-cd ::
# Command-line fuzzy finder written in Go
# https://github.com/junegunn/fzf
brew "fzf"
# Terminal JSON viewer
# https://fx.wtf
brew "fx"
# Lightweight and flexible command-line JSON processor
# https://stedolan.github.io/jq/
brew "jq"
brew 'gtop'
# This is htop, a cross-platform interactive process viewer. It is a text-mode 
# application (for console or X terminals) and requires ncurses.
# https://htop.dev
brew "htop"
# Tools and libraries to manipulate images in many formats
# https://imagemagick.org/index.php
brew "imagemagick"
# Keep your application settings in sync (OS X/Linux)
# https://github.com/lra/mackup
brew "mackup"
# Mac App Store command-line interface
# https://github.com/mas-cli/mas
brew "mas"
# Fast, highly customisable system info script
# https://github.com/dylanaraps/neofetch
brew "neofetch"
# Emulator for x86 and PowerPC
# https://www.qemu.org
brew "qemu"
# Command-line interface for https://speedtest.net bandwidth tests
# https://github.com/sivel/speedtest-cli
brew "speedtest-cli"
# CLI tool that moves files or folder to the trash
# https://hasseg.org/trash/
brew "trash"
# Display directories as trees (with optional color/HTML output)
# http://mama.indstate.edu/users/ice/tree/
brew "tree"
# Ambitious Vim-fork focused on extensibility and agility
# https://neovim.io/
brew "neovim"
# YAML syntax highlighter to bring colours where only jq could
# https://github.com/andreazorzetto/yh
brew "yh"
# Fish-like fast/unobtrusive autosuggestions for zsh
# https://github.com/zsh-users/zsh-autosuggestions
brew "zsh-autosuggestions"
# Fish shell like syntax highlighting for zsh
# https://github.com/zsh-users/zsh-syntax-highlighting
brew "zsh-syntax-highlighting"


#### Casks ####

cask "1password"
cask "1password-cli"
cask "adguard"
cask "alfred"
cask "anydesk"
cask "appcleaner"
cask "brewservicesmenubar"
cask "browserosaurus"
cask "cleanshot"
cask "discord"
cask "dropbox"
cask "firefox"
# Flip clock screensaver
# https://fliqlo.com/
cask "fliqlo"
# Download manager with a torrent client
# https://mac.eltima.com/download-manager.html
cask "folx"
cask "fork"
cask "gimp"
cask "google-chrome"
cask "iterm2"
# Names: Jami, Savoir-faire Linux Ring
# Decentralised instant messenger and softphone
# https://jami.net/
cask "jami"
cask "jetbrains-toolbox"
# Menu bar calendar
# https://www.mowglii.com/itsycal/
cask "itsycal"
cask "keka"
cask "keystore-explorer"
# Clipboard manager
# https://maccy.app/
cask "maccy"
cask "messenger"
cask "notion"
cask "obsidian"
cask "postman"
# GUI for streamlined Redis application development
# https://redis.com/redis-enterprise/redis-insight/
cask "redisinsight"
# Move and resize windows using keyboard shortcuts or snap areas
# https://rectangleapp.com/
cask "rectangle"
cask "signal"
cask "slack"
cask "spotify"
cask "telegram"
cask "thingsmacsandboxhelper"
cask "tower"
cask "upwork"
# Virtual machines UI using QEMU
# https://getutm.app/
cask "utm"
cask "vanilla"
cask "visual-studio-code"
cask "visualvm"
cask "zoom"

#### Quicklook ####

cask "qlcolorcode"
cask "qlvideo"
cask "qlstephen"
cask "qlmarkdown"
cask "quicklook-json"
cask "WebPQuickLook"


#### Fonts ####

cask "font-lato"
cask "font-roboto"
cask "font-open-sans"
cask "font-jetbrains-mono"
cask "font-source-code-pro"
cask "font-source-sans-pro"
cask "font-source-serif-pro"
cask "font-source-code-pro-for-powerline"
# nerd fonts
cask "font-3270-nerd-font"
cask "font-fira-mono-nerd-font"
cask "font-inconsolata-go-nerd-font"
cask "font-inconsolata-lgc-nerd-font"
cask "font-inconsolata-nerd-font"
cask "font-monofur-nerd-font"
cask "font-overpass-nerd-font"
cask "font-ubuntu-mono-nerd-font"
cask "font-agave-nerd-font"
cask "font-arimo-nerd-font"
cask "font-anonymice-nerd-font"
cask "font-aurulent-sans-mono-nerd-font"
cask "font-bigblue-terminal-nerd-font"
cask "font-bitstream-vera-sans-mono-nerd-font"
cask "font-blex-mono-nerd-font"
cask "font-caskaydia-cove-nerd-font"
cask "font-code-new-roman-nerd-font"
cask "font-cousine-nerd-font"
cask "font-daddy-time-mono-nerd-font"
cask "font-dejavu-sans-mono-nerd-font"
cask "font-droid-sans-mono-nerd-font"
cask "font-fantasque-sans-mono-nerd-font"
cask "font-fira-code-nerd-font"
cask "font-go-mono-nerd-font"
cask "font-gohufont-nerd-font"
cask "font-hack-nerd-font"
cask "font-hasklug-nerd-font"
cask "font-heavy-data-nerd-font"
cask "font-hurmit-nerd-font"
cask "font-im-writing-nerd-font"
cask "font-iosevka-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-lekton-nerd-font"
cask "font-liberation-nerd-font"
cask "font-meslo-lg-nerd-font"
cask "font-monoid-nerd-font"
cask "font-mononoki-nerd-font"
cask "font-mplus-nerd-font"
cask "font-noto-nerd-font"
cask "font-open-dyslexic-nerd-font"
cask "font-profont-nerd-font"
cask "font-proggy-clean-tt-nerd-font"
cask "font-roboto-mono-nerd-font"
cask "font-sauce-code-pro-nerd-font"
cask "font-shure-tech-mono-nerd-font"
cask "font-space-mono-nerd-font"
cask "font-terminess-ttf-nerd-font"
cask "font-tinos-nerd-font"
cask "font-ubuntu-nerd-font"
cask "font-victor-mono-nerd-font"

#### Mac App Store ####

mas "1Password for Safari", id: 1569813296
mas "Amphetamine", id: 937984704
mas "AudioBookBinder", id: 413969927
mas "Battery Health 2", id: 1120214373
mas "Calendars", id: 608834326
mas "CleanMyDrive 2", id: 523620159
mas "Grammarly for Safari", id: 1462114288
mas "Keynote", id: 409183694
mas "Magnet", id: 441258766
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "pomodorome", id: 1484801884
mas "ScreenBrush", id: 1233965871
mas "Spark", id: 1176895641
mas "Startup Disk Full Fixer", id: 1346655838
mas "Things", id: 904280696
mas "Trello", id: 1278508951
mas "Tweetbot", id: 1384080005
mas "Xcode", id: 497799835


#### Testing ####
# Brew
# Mas