tap "homebrew/autoupdate"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "1password/tap"
tap "buildpacks/tap"
tap "graalvm/tap"
tap "dart-lang/dart"
tap "maciejwalkowiak/brew"
tap "mdogan/zulu"
tap "spring-io/tap"
tap "ubuntu/microk8s"

brew "ansible"
brew "anyenv"
brew "aws-cdk"
brew "awscli"
brew "gmp"
brew "aom"
brew "bluetoothconnector"
brew "btop"
brew "ctop"
brew "cmake"
brew "harfbuzz"
brew "tesseract"
brew "cocoapods"
brew "composer"
brew "coreutils"
brew "dart"
brew "glib"
brew "gnutls"
brew "pango"
brew "ffmpeg"
brew "cmus"
brew "libyaml"
brew "dive"
brew "libssh2"
brew "curl"
brew "gh"
brew "node"
brew "fx"
brew "fzf"
brew "libavif"
brew "gd"
brew "git"
brew "ghostscript"
brew "gnupg"
brew "git-flow"
brew "go"
brew "gradle"
brew "groovy"
brew "graphviz"
brew "httpie"
brew "helm"
brew "htop"
brew "jhipster"
brew "julia"
brew "imagemagick"
brew "libheif"
brew "openssl@1.1"
brew "openssl@3"
brew "python"
brew "libraw"
brew "imagemagick"
brew "jmeter"
brew "just"
brew "jq"
brew "kotlin"
brew "kdoctor"
brew "kind"
brew "k9s"
brew "kubernetes-cli"
brew "libpq"
brew "lua"
brew "luarocks"
brew "luv"
brew "mackup"
brew "mas"
brew "maven"
brew "minikube"
brew "neovim"
brew "podman"
brew "neofetch"
brew "openjdk"
brew "openjdk@8"
brew "openjdk@11"
brew "openjdk@17"
brew "openjdk@21"
brew "php"
brew "pinentry-mac"
# brew "rustup-init"
brew "qemu"
brew "readline"
brew "ripgrep"
brew "speedtest-cli"
brew "stow"
brew "tealdeer"
brew "tmux"
brew "telnet"
brew "terraform"
brew "trash", link: false
brew "trash-cli"
brew "tree"
brew "wget"
brew "yh"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "pack"
brew "spring-boot"
brew "microk8s"

cask "1password"
cask "1password-cli"
cask "adguard"
cask "alfred"
# cask "anydesk"
cask "alt-tab"
cask "anydesk"
cask "apparency"
cask "appcleaner"
cask "arc"
cask "brewservicesmenubar"
cask "browserosaurus"
# cask "cleanshot@4.5.1"
cask "codeedit"
cask "corretto8"
cask "corretto11"
cask "corretto17"
cask "corretto"
cask "daisydisk"
cask "dbeaver-community"
cask "discord"
cask "docker"
cask "drawio"
cask "eclipse-jee"
cask "figma"
cask "firefox"
cask "fliqlo"
cask "flutter"
cask "folx"
cask "font-fira-code"
cask "font-fira-code-nerd-font"
cask "font-fira-mono"
cask "font-fira-mono-for-powerline"
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"
cask "font-meslo-lg"
cask "font-meslo-lg-dz"
cask "font-meslo-lg-nerd-font"
# cask "fork"
cask "gimp"
cask "google-chrome"
cask "graalvm-ce-java8"
cask "graalvm-ce-java11"
cask "graalvm-ce-java17"
cask "graalvm-ce-java19"
cask "iterm2"
cask "jetbrains-toolbox"
cask "keka"
cask "keystore-explorer"
cask "lens"
cask "meld"
cask "messenger"
cask "microsoft-remote-desktop"
cask "miro"
cask "mongodb-compass"
cask "monitorcontrol"
cask "microsoft-teams"
cask "multipass"
cask "netbeans"
cask "netnewswire"
cask "notion"
cask "notion-calendar"
cask "obs"
cask "obsidian"
cask "podman-desktop"
cask "postman"
cask "proxyman"
cask "pulsar"
cask "qlcolorcode"
cask "qlimagesize"
cask "qlmarkdown"
cask "qlstephen"
cask "qlvideo"
cask "quicklook-json"
cask "quicklookase"
# cask "rectangle"
cask "redisinsight"
cask "slack"
cask "spotify"
cask "springtoolsuite"
cask "sublime-text"
cask "suspicious-package"
cask "telegram"
cask "temurin"
cask "temurin8"
cask "temurin11"
cask "temurin17"
cask "temurin21"
cask "thingsmacsandboxhelper"
cask "tower"
cask "utm"
cask "vanilla"
cask "visual-studio-code"
cask "visualvm"
cask "vlc"
cask "vmware-fusion"
cask "warp"
cask "webpquicklook"
cask "zoom"
cask "zed"
cask "zulu-jdk11"
cask "zulu-jdk17"
cask "zulu-jdk21"
cask "zulu-jdk8"
cask "zulu-mc"

mas "1Password for Safari", id: 1569813296
mas "Amphetamine", id: 937984704
mas "AudioBookBinder", id: 413969927
mas "Battery Health 2", id: 1120214373
mas "CleanMyDrive 2", id: 523620159
mas "Color Picker", id: 1545870783
mas "Dato", id: 1470584107
mas "Ivory", id: 6444602274
mas "Ivory", id: 6444602274
mas "JustStream", id: 1474804779
mas "Keynote", id: 409183694
mas "Magnet", id: 441258766
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Pixea", id: 1507782672
mas "pomodorome", id: 1484801884
mas "ScreenBrush", id: 1233965871
mas "Startup Disk Full Fixer", id: 1346655838
mas "Things", id: 904280696
mas "Trello", id: 1278508951
mas "Unsplash Wallpapers", id: 1284863847
mas "WhatsApp", id: 1147396723
mas "Xcode", id: 497799835
mas "Hand Mirror", id: 1502839586

vscode "asciidoctor.asciidoctor-vscode"
vscode "codezombiech.gitignore"
vscode "dart-code.dart-code"
vscode "dart-code.flutter"
vscode "Dedsec727.jekyll-run"
vscode "dgileadi.java-decompiler"
vscode "donjayamanne.githistory"
vscode "donjayamanne.python-environment-manager"
vscode "donjayamanne.python-extension-pack"
vscode "dsznajder.es7-react-js-snippets"
vscode "eamodio.gitlens"
vscode "emmanuelbeziat.vscode-great-icons"
vscode "esbenp.prettier-vscode"
vscode "FelixAngelov.bloc"
vscode "file-icons.file-icons"
vscode "gera2ld.markmap-vscode"
vscode "GitHub.github-vscode-theme"
vscode "GitHub.vscode-pull-request-github"
vscode "Gruntfuggly.todo-tree"
vscode "guilhermestella.guilhermestella-java-ext"
vscode "ithildir.java-properties"
vscode "jasonnutter.search-node-modules"
vscode "jebbs.plantuml"
vscode "k--kato.intellij-idea-keybindings"
vscode "mechatroner.rainbow-csv"
vscode "ms-azuretools.vscode-docker"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-ossdata.vscode-postgresql"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-wsl"
vscode "mtxr.sqltools"
vscode "naco-siren.gradle-language"
vscode "oderwat.indent-rainbow"
vscode "PKief.material-icon-theme"
vscode "Pleiades.java-extension-pack-jdk"
vscode "Postman.postman-for-vscode"
vscode "pverest.java-ide-pack"
vscode "redhat.ansible"
vscode "redhat.fabric8-analytics"
vscode "redhat.java"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "richardwillis.vscode-gradle-extension-pack"
vscode "ritwickdey.LiveServer"
vscode "shardulm94.trailing-spaces"
vscode "shengchen.vscode-checkstyle"
vscode "sissel.shopify-liquid"
vscode "streetsidesoftware.code-spell-checker"
vscode "usernamehw.errorlens"
vscode "VisualStudioExptTeam.intellicode-api-usage-examples"
vscode "VisualStudioExptTeam.vscodeintellicode"
vscode "vmware.vscode-boot-dev-pack"
vscode "vmware.vscode-spring-boot"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "vscjava.vscode-spring-boot-dashboard"
vscode "vscjava.vscode-spring-initializr"
vscode "WakaTime.vscode-wakatime"
vscode "wayou.vscode-todo-highlight"
vscode "wholroyd.jinja"
vscode "YouMayCallMeV.vscode-java-saber"
vscode "yzhang.markdown-all-in-one"
vscode "ziyasal.vscode-open-in-github"