tap '1password/tap'
tap 'atomicjar/tap'
tap 'buildpacks/tap'
tap 'graalvm/tap'
tap 'hashicorp/tap'
tap 'homebrew/autoupdate'
tap 'homebrew/core'
tap 'maciejwalkowiak/brew'
tap 'mdogan/zulu'
tap 'netbirdio/tap'
tap 'shaunsingh/sfmono-nerd-font-ligaturized'
tap 'spring-io/tap'
tap 'ubuntu/microk8s'

brew 'bash'
# Cryptography and SSL/TLS Toolkit
brew 'openssl@3'
# YAML Parser
brew 'libyaml'
# Library for command-line editing
brew 'readline'
# Automate deployment, configuration, and upgrading
brew 'ansible'
# All in one for **env
brew 'anyenv'
brew 'bat'
# Arbitrary precision numeric processing language
brew 'bc'
# Python code formatter
brew 'black'
# CLI of the open-source IDE For exploring and testing APIs
brew 'bruno-cli'
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew 'btop'
# Core application library for C
brew 'glib'
brew 'gh'
brew 'glab'
# Manage your dotfiles across multiple diverse machines, securely
brew 'chezmoi'
# Cross-platform make
brew 'cmake'
# GNU Transport Layer Security (TLS) Library
brew 'gnutls'
# OpenType text shaping engine
brew 'harfbuzz'
# Interpreted, interactive, object-oriented programming language
brew 'python@3.12', link: false
# Framework for layout and rendering of i18n text
brew 'pango'
# OCR (Optical Character Recognition) engine
brew 'tesseract'
# Play, record, convert, and stream audio and video
brew 'ffmpeg'
# Music player with an ncurses based interface
brew 'cmus'
# Dependency manager for Cocoa projects
brew 'cocoapods'
# Get a file from an HTTP, HTTPS or FTP server
brew 'curl'
# Library for encoding and decoding .avif files
brew 'libavif'
# Graphics library to dynamically manipulate images
brew 'gd'
# General-purpose scripting language
brew 'php'
# Dependency Manager for PHP
brew 'composer'
# GNU File, Shell, and Text utilities
brew 'coreutils'
# Top-like interface for container metrics
brew 'ctop'
# Tool for exploring each layer in a docker image
brew 'dive'
# Modern, maintained replacement for ls
brew 'eza'
# Simple, fast and user-friendly alternative to find
brew 'fd'
# Terminal JSON viewer
brew 'fx'
# Command-line fuzzy finder written in Go
brew 'fzf'
# GNU awk utility
brew 'gawk'
# Distributed revision control system
brew 'git'
# GNU implementation of the famous stream editor
brew 'gnu-sed'
# GNU Pretty Good Privacy (PGP) package
brew 'gnupg'
# Open source programming language to build simple/reliable/efficient software
brew 'go'
# Open-source build automation tool based on the Groovy and Kotlin DSL
brew 'gradle'
# Library to render SVG files using Cairo
brew 'librsvg'
# Graph visualization software from AT&T and Bell Labs
brew 'graphviz'
# Java-based scripting language
brew 'groovy'
# Kubernetes package manager
brew 'helm'
# Improved top (interactive process viewer)
brew 'htop'
# User-friendly cURL replacement (command-line HTTP client)
brew 'httpie'
# Generate, develop and deploy Spring Boot + Angular/React applications
brew 'jhipster'
# Development kit for the Java programming language
brew 'openjdk@21'
# Load testing and performance measurement application
brew 'jmeter'
# Lightweight and flexible command-line JSON processor
brew 'jq'
# Fast, Dynamic Programming Language
brew 'julia'
# Handy way to save and run project-specific commands
brew 'just'
# Kubernetes CLI To Manage Your Clusters In Style!
brew 'k9s'
# Environment diagnostics for Kotlin Multiplatform Mobile app development
brew 'kdoctor'
# Run local Kubernetes cluster in Docker
brew 'kind'
# Statically typed programming language for the JVM
brew 'kotlin'
# Kubernetes command-line interface
brew 'kubernetes-cli'
# Lazier way to manage everything docker
brew 'lazydocker'
# Simple terminal UI for git commands
brew 'lazygit'
# ISO/IEC 23008-12:2017 HEIF file format decoder and encoder
brew 'libheif'
# Powerful, lightweight programming language
brew 'lua'
# Package manager for the Lua programming language
brew 'luarocks'
# Bare libuv bindings for lua
brew 'luv'
# Keep your Mac's application settings in sync
brew 'mackup'
# Mac App Store command-line interface
brew 'mas'
# Java-based project management
brew 'maven'
# Run a Kubernetes cluster locally
brew 'minikube'
# Ambitious Vim-fork focused on extensibility and agility
brew 'neovim'
# Retrieves currently playing media, and simulates media actions
brew 'nowplaying-cli'
# Pinentry for GPG on Mac
brew 'pinentry-mac'
# Package compiler and linker metadata toolkit
brew 'pkgconf'
# Paste PNG into files
brew 'pngpaste'
# Tool for managing OCI containers and pods
brew 'podman'
# PDF rendering library (based on the xpdf-3.0 code base)
brew 'poppler'
# Code formatter for JavaScript, CSS, JSON, GraphQL, Markdown, YAML
brew 'prettier'
# Generic machine emulator and virtualizer
brew 'qemu'
# Search tool like grep and The Silver Searcher
brew 'ripgrep'
# Command-line interface for https://speedtest.net bandwidth tests
brew 'speedtest-cli'
# Cross-shell prompt for astronauts
brew 'starship'
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew 'stow'
# Very fast implementation of tldr in Rust
brew 'tealdeer'
# User interface to the TELNET protocol
brew 'telnet'
# Programmatically correct mistyped console commands
brew 'thefuck'
# Terminal multiplexer
brew 'tmux'
# Plugin manager for tmux
brew 'tpm'
# Command-line interface to the freedesktop.org trashcan
brew 'trash-cli'
# Display directories as trees (with optional color/HTML output)
brew 'tree'
# Internet file retriever
brew 'wget'
# JavaScript package manager
brew 'yarn'
# YAML syntax highlighter to bring colours where only jq could
brew 'yh'
# Shell extension to navigate your filesystem faster
brew 'zoxide'
# A CLI for building apps using Cloud Native Buildpacks
brew 'buildpacks/tap/pack'
# Terraform
brew 'hashicorp/tap/terraform'
# Netbird project.
brew 'netbirdio/tap/netbird'
brew 'spring-io/tap/spring-boot'
# Small, fast, single-package Kubernetes for developers, IoT and edge
brew 'ubuntu/microk8s/microk8s'

# Password manager that keeps all passwords secure behind one password
cask '1password'
# Command-line interface for 1Password
cask '1password/tap/1password-cli'
# Stand alone ad blocker
cask 'adguard'
# GPU-accelerated terminal emulator
cask 'alacritty'
# Application launcher and productivity software
cask 'alfred'
# Control your tools with a few keystrokes
cask 'raycast'
# Allows connection to a computer remotely
cask 'anydesk'
# Application uninstaller
cask 'appcleaner'
# Chromium based browser
cask 'arc'
# Open-source browser prompter
cask 'browserosaurus'
# Menu item for starting and stopping homebrew services
cask 'brewservicesmenubar'
# Open source IDE for exploring and testing APIs
cask 'bruno'
# OpenJDK distribution from Amazon
cask 'corretto@8'
cask 'corretto@11'
cask 'corretto@17'
cask 'corretto@21'
cask 'corretto'
# Write, edit, and chat about your code with AI
cask 'cursor'
# Disk space visualiser
cask 'daisydisk'
# Universal database tool and SQL client
cask 'dbeaver-community'
# Voice and text chat software
cask 'discord'
# App to build and share containerised applications and microservices
cask 'docker'
# Online diagram software
cask 'drawio'
# Collaborative team software
cask 'figma'
# Web browser
cask 'firefox'
# Flip clock screensaver
cask 'fliqlo'
# UI toolkit for building applications for mobile, web and desktop
cask 'flutter'
# Download manager with a torrent client
cask 'folx'
cask 'font-fira-code'
cask 'font-fira-code-nerd-font'
cask 'font-fira-mono'
cask 'font-fira-mono-for-powerline'
cask 'font-jetbrains-mono'
cask 'font-jetbrains-mono-nerd-font'
cask 'font-meslo-lg'
cask 'font-meslo-lg-dz'
cask 'font-meslo-lg-nerd-font'
cask 'font-sf-mono-nerd-font-ligaturized'
# GIT client
cask 'fork'
# Git client for simultaneous branches on top of your existing workflow
cask 'gitbutler'
# Web browser
cask 'google-chrome'
# Client for the Google Drive storage service
cask 'google-drive'
# Utility to hide menu bar items
cask 'hiddenbar'
# Testing client for REST, GraphQL, and HTTP APIs
cask 'httpie'
# Terminal emulator as alternative to Apple's Terminal app
cask 'iterm2'
# Enable generative AI features in iTerm2
cask 'itermai'
# JetBrains tools manager
cask 'jetbrains-toolbox'
# File archiver
cask 'keka'
# Blocks all Keyboard and TouchBar input
cask 'keyboardcleantool'
# Open-source keystroke visualiser
cask 'keycastr'
# GUI replacement for the Java command-line utilities keytool and jarsigner
cask 'keystore-explorer'
# GPU-based terminal emulator
cask 'kitty'
# Kubernetes IDE
cask 'lens'
# Native desktop app for Messenger (formerly Facebook Messenger)
cask 'messenger'
# Create mock APIs in seconds
cask 'mockoon'
# Interactive tool for analyzing MongoDB data
cask 'mongodb-compass'
# Run LLMs locally
cask 'msty'
# Orchestrates virtual Ubuntu instances
cask 'multipass'
# Development environment, tooling platform and application framework
cask 'netbeans'
# Netbird UI Client
cask 'netbird-ui'
# Free and open-source RSS reader
cask 'netnewswire'
# App to write, plan, collaborate, and get organised
cask 'notion'
# Open-source software for live streaming and screen recording
cask 'obs'
# Knowledge base that works on top of a local folder of plain text Markdown files
cask 'obsidian'
# Get up and running with large language models locally
cask 'ollama'
# Client program for the OpenVPN Access Server
cask 'openvpn-connect'
# Replacement for Docker Desktop
cask 'orbstack'
# Utility to uninstall apps and remove leftover files from old/uninstalled apps
cask 'pearcleaner'
# Administration and development platform for PostgreSQL
cask 'pgadmin4'
# Browse, manage, inspect containers and images
cask 'podman-desktop'
# Collaboration platform for API development
cask 'postman'
# HTTP debugging proxy
cask 'proxyman'
# Quick Look plug-in that renders source code with syntax highlighting
cask 'qlcolorcode'
# Quick Look generator for Markdown files
cask 'qlmarkdown'
# Quick Look plugin for Swift files
cask 'qlplayground'
# Quick Look plugin to view patch files
cask 'qlprettypatch'
# Quick Look plugin for plaintext files without an extension
cask 'qlstephen'
# Thumbnails, static previews, cover art and metadata for video files
cask 'qlvideo'
# Quick Look plugin for CSV files
cask 'quicklook-csv'
# Quick Look plugin for JSON files
cask 'quicklook-json'
# Quick Look generator for Adobe Swatch Exchange files
cask 'quicklookase'
# Move and resize windows using keyboard shortcuts or snap areas
cask 'rectangle'
# GUI for streamlined Redis application development
cask 'redis-insight'
# Instant messaging application focusing on security
cask 'signal'
# Team communication and collaboration software
cask 'slack'
# Music streaming service
cask 'spotify'
# Next generation tooling for Spring Boot
cask 'springtoolsforeclipse'
# Text editor for code, markup and prose
cask 'sublime-text'
# Messaging app with a focus on speed and security
cask 'telegram'
# Tescontainers desktop application for local testing and development
cask 'testcontainers-desktop'
# Helper application for Things
cask 'thingsmacsandboxhelper'
# To-do list
cask 'todoist'
# Git client focusing on power and productivity
cask 'tower'
# Adaptive AI IDE
cask 'trae'
cask 'cursor'
# Virtual machines UI using QEMU
cask 'utm'
# Tool to hide menu bar icons
cask 'vanilla'
# Calling and messaging application focusing on security
cask 'viber'
# Open-source code editor
cask 'visual-studio-code'
# All-in-One Java Troubleshooting Tool
cask 'visualvm'
# Multimedia player
cask 'vlc'
# System tray app for automatic time tracking
cask 'wakatime'
# Rust-based terminal
cask 'warp'
# Terminal emulator
cask 'wave'
# Quick Look plugin for webp files
cask 'webpquicklook'
# Free messaging and calling application
cask 'wechat'
# Native desktop client for WhatsApp
cask 'whatsapp'
# Agentic IDE powered by AI Flow paradigm
cask 'windsurf'
# Tune in to Yandex Music and get personal recommendations
cask 'yandex-music'
# Multiplayer code editor
cask 'zed'
# Gecko based web browser
cask 'zen'
# Video communication and virtual meeting platform
cask 'zoom'
# Matrix colaboration client
cask 'element'

mas '1Password for Safari', id: 1_569_813_296
mas 'Amphetamine', id: 937_984_704
mas 'Battery Health 2', id: 1_120_214_373
mas 'CleanMyDrive 2', id: 523_620_159
mas 'Color Picker', id: 1_545_870_783
mas 'Dato', id: 1_470_584_107
mas 'DevCleaner', id: 1_388_020_431
mas 'Dropover', id: 1_355_679_052
mas 'Hand Mirror', id: 1_502_839_586
mas 'Keynote', id: 409_183_694
mas 'Magnet', id: 441_258_766
mas 'Numbers', id: 409_203_825
mas 'Pages', id: 409_201_541
mas 'Pixea', id: 1_507_782_672
mas 'pomodorome', id: 1_484_801_884
mas 'ScreenBrush', id: 1_233_965_871
mas 'Spark', id: 1_176_895_641
mas 'Startup Disk Full Fixer', id: 1_346_655_838
mas 'Things', id: 904_280_696
mas 'Trello', id: 1_278_508_951
mas 'Unsplash Wallpapers', id: 1_284_863_847
mas 'WaterMinder', id: 1_415_257_369
mas 'Xcode', id: 497_799_835
mas 'Messenger', id: 454_638_411
mas 'Whatsapp Messenger', id: 310_633_997

vscode 'angular.ng-template'
vscode 'chadalen.vscode-jetbrains-icon-theme'
vscode 'codezombiech.gitignore'
vscode 'cweijan.vscode-database-client2'
vscode 'dart-code.dart-code'
vscode 'dart-code.flutter'
vscode 'davidanson.vscode-markdownlint'
vscode 'dgileadi.java-decompiler'
vscode 'docker.docker'
vscode 'eamodio.gitlens'
vscode 'enkia.tokyo-night'
vscode 'esbenp.prettier-vscode'
vscode 'formulahendry.auto-rename-tag'
vscode 'hashicorp.terraform'
vscode 'isudox.vscode-jetbrains-keybindings'
vscode 'k--kato.intellij-idea-keybindings'
vscode 'mongodb.mongodb-vscode'
vscode 'morrislaptop.vscode-open-in-git-tower'
vscode 'ms-azuretools.vscode-containers'
vscode 'ms-kubernetes-tools.vscode-kubernetes-tools'
vscode 'ms-python.debugpy'
vscode 'ms-python.python'
vscode 'ms-python.vscode-pylance'
vscode 'ms-vscode-remote.remote-containers'
vscode 'naco-siren.gradle-language'
vscode 'redhat.ansible'
vscode 'redhat.java'
vscode 'redhat.vscode-xml'
vscode 'redhat.vscode-yaml'
vscode 'redis.redis-for-vscode'
vscode 'richardwillis.vscode-gradle-extension-pack'
vscode 'rohinivsenthil.rabbitrace'
vscode 'shengchen.vscode-checkstyle'
vscode 'visualstudioexptteam.intellicode-api-usage-examples'
vscode 'visualstudioexptteam.vscodeintellicode'
vscode 'vmware.vscode-boot-dev-pack'
vscode 'vmware.vscode-spring-boot'
vscode 'vmware.vscode-spring-cli'
vscode 'vscjava.vscode-gradle'
vscode 'vscjava.vscode-java-debug'
vscode 'vscjava.vscode-java-dependency'
vscode 'vscjava.vscode-java-pack'
vscode 'vscjava.vscode-java-test'
vscode 'vscjava.vscode-maven'
vscode 'vscjava.vscode-spring-boot-dashboard'
vscode 'vscjava.vscode-spring-initializr'
vscode 'wakatime.vscode-wakatime'
vscode 'wayou.vscode-todo-highlight'
vscode '1password.op-vscode'
vscode 'ritwickdey.liveserver'
