tap '1password/tap'
tap 'buildpacks/tap'
tap 'dart-lang/dart'
tap 'graalvm/tap'
tap 'homebrew/autoupdate'
tap 'homebrew/bundle'
tap 'homebrew/services'
tap 'hashicorp/tap'
tap 'maciejwalkowiak/brew'
tap 'mdogan/zulu'
tap 'spring-io/tap'
tap 'atomicjar/tap'
tap 'ubuntu/microk8s'
tap 'shaunsingh/SFMono-Nerd-Font-Ligaturized'

# uname -m returns the architecture of the system.
# - For ARM-based Macs, this returns "arm64".
# - For Intel-based Macs, it returns "x86_64".
arch = `uname -m`.chomp

brew 'libyaml'
brew 'openssl@3'
brew 'readline'
brew 'ansible'
brew 'anyenv'
brew 'gmp'
brew 'bash'
brew 'bc'
brew 'black'
brew 'coreutils'
brew 'gawk'
brew 'gsed'
brew 'btop'
brew 'cmake'
brew 'cmus'
brew 'composer'
brew 'cocoapods'
brew 'coreutils'
brew 'ctop'
brew 'libssh2'
brew 'curl'
brew 'dive'
brew 'dart'
brew 'eza'
brew 'fx'
brew 'fd'
brew 'fzf'
brew 'libavif'
brew 'gd'
brew 'git'
brew 'go'
brew 'gnupg'
brew 'gradle'
brew 'graphviz'
brew 'groovy'
brew 'helm'
brew 'htop'
brew 'httpie'
brew 'lazygit'
brew 'libheif'
brew 'luarocks'
brew 'jhipster'
brew 'jmeter'
brew 'jq'
brew 'julia'
brew 'just'
brew 'k9s'
brew 'kdoctor'
brew 'kind'
brew 'kotlin'
brew 'kubernetes-cli'
brew 'libpq'
brew 'mackup'
brew 'mas'
brew 'maven'
brew 'minikube'
brew 'microk8s'
brew 'minikube'
brew 'neovim'
# Java: Openjdk
brew 'openjdk@8' if arch == 'x86_64'
brew 'openjdk@11'
brew 'openjdk@17'
brew 'openjdk@21'
brew 'openjdk'
brew 'nowplaying-cli'
brew 'podman'
brew 'php'
brew 'pngpaste'
brew 'prettier'
brew 'pinentry-mac'
brew 'qemu'
brew 'ripgrep'
brew 'rust'
brew 'stow'
brew 'tealdeer'
brew 'telnet'
brew 'terraform'
brew 'tpm'
brew 'tmux'
brew 'trash-cli'
brew 'tree'
brew 'wget'
brew 'yarn'
brew 'yh'
brew 'pack'
brew 'zoxide'
brew 'spring-boot'
brew 'microk8s'
# App's
cask '1password'
cask '1password-cli'
cask 'adguard'
cask 'alacritty'
cask 'alcove'
cask 'alfred'
cask 'anydesk'
cask 'appcleaner'
cask 'arc'
cask 'chatgpt' if arch == 'arm64'
cask 'clop'
cask 'daisydisk'
cask 'docker'
cask 'orbstack'
cask 'drawio'
cask 'flux'
cask 'figma'
cask 'firefox'
cask 'flameshot' if arch == 'arm64'
cask 'gimp'
cask 'google-chrome'
cask 'hiddenbar'
cask 'iterm2'
cask 'itermai'
cask 'keka'
cask 'keycastr' if arch == 'x86_64'
cask 'kitty'
cask 'microsoft-remote-desktop' if arch == 'arm64'
cask 'meetingbar'
cask 'miro'
cask 'msty'
cask 'multipass'
cask 'netnewswire'
cask 'notion'
cask 'notion-calendar'
cask 'obs'
cask 'obsidian'
cask 'ollama'
cask 'openvpn-connect' if arch == 'x86_64'
cask 'pearcleaner'
cask 'rectangle'
cask 'spotify'
cask 'todoist'
cask 'twist' if arch == 'arm64'
cask 'testcontainers-desktop'
cask 'utm'
cask 'vlc'
cask 'wakatime'
cask 'yandex-music' if arch == 'x86_64'
# Messanger's
cask 'discord'
cask 'messenger' if arch == 'x86_64'
cask 'signal'
cask 'slack'
cask 'telegram'
cask 'viber'
cask 'wechat'
cask 'whatsapp'
cask 'zoom'
# Editor's
cask 'dbeaver-community'
cask 'gitbutler'
cask 'fork'
cask 'lens'
cask 'mongodb-compass'
cask 'pgadmin4'
cask 'podman-desktop'
cask 'postman'
cask 'proxyman'
cask 'pulsar'
cask 'redis-insight'
cask 'sublime-text'
cask 'tower'
cask 'visual-studio-code'
cask 'warp'
cask 'wave'
cask 'zed'
# Utils
cask 'folx'
cask 'fliqlo'
cask 'vanilla'
cask 'monitorcontrol'
cask 'browserosaurus'
cask 'brewservicesmenubar'
cask 'thingsmacsandboxhelper'
# Quick Look Plugins
cask 'qlcolorcode'
cask 'qlimagesize'
cask 'qlmarkdown'
cask 'qlstephen'
cask 'qlvideo'
cask 'quicklook-json'
cask 'quicklookase'
cask 'qlprettypatch'
cask 'quicklook-csv'
cask 'qlplayground'
cask 'webpquicklook'
# Font's
cask 'font-fira-code'
cask 'font-fira-code-nerd-font'
cask 'font-fira-mono'
cask 'font-fira-mono-for-powerline'
cask 'font-jetbrains-mono'
cask 'font-jetbrains-mono-nerd-font'
cask 'font-meslo-lg'
cask 'font-meslo-lg-dz'
cask 'font-meslo-lg-nerd-font'
cask 'font-sf-mono-nerd-font-ligaturized'
# Java: Amazon Corretto releases
cask 'corretto@8'
cask 'corretto@11'
cask 'corretto@17'
cask 'corretto@21'
cask 'corretto'
# Java: Eclipse Temurin releases
cask 'temurin@8'
cask 'temurin@11'
cask 'temurin@17'
cask 'temurin@21'
cask 'temurin'
# Java: GraalVM CE releases
# repository: https://github.com/graalvm/homebrew-tap
cask 'graalvm-community-jdk17'
cask 'graalvm-community-jdk21'
cask 'graalvm-community-jdk22'
# Java: Zulu JDK releases
cask 'zulu-jdk8'
cask 'zulu-jdk11'
cask 'zulu-jdk17'
cask 'zulu-jdk21'
cask 'zulu'
# Java: IDE's
cask 'jetbrains-toolbox'
cask 'eclipse-installer'
cask 'springtoolsuite'
cask 'netbeans'
# Java: Tool's
cask 'keystore-explorer'
cask 'visualvm'
# Java: Mission Controls
cask 'zulu-mc'
# Learning
cask 'flutter'

# Mac App Store
mas '1Password for Safari', id: 1_569_813_296
mas 'Amphetamine', id: 937_984_704
mas 'AudioBookBinder', id: 413_969_927
mas 'Battery Health 2', id: 1_120_214_373
mas 'CleanMyDrive 2', id: 523_620_159
mas 'Color Picker', id: 1_545_870_783
mas 'Dato', id: 1_470_584_107
mas 'Dropover - Easier Drag & Drop', id: 1_355_679_052
mas 'Hand Mirror', id: 1_502_839_586
mas 'HEIC Converter', id: 1_294_126_402
mas 'Ivory', id: 6_444_602_274
mas 'Keynote', id: 409_183_694
mas 'Magnet', id: 441_258_766
mas 'Numbers', id: 409_203_825
mas 'OttPlayer', id: 1_306_611_194
mas 'Pages', id: 409_201_541
mas 'Pixea', id: 1_507_782_672
mas 'pomodorome', id: 1_484_801_884
mas 'ScreenBrush', id: 1_233_965_871
mas 'Spark', id: 1_176_895_641
mas 'Startup Disk Full Fixer', id: 1_346_655_838
mas 'Things', id: 904_280_696
mas 'Trello', id: 1_278_508_951
mas 'Unsplash Wallpapers', id: 1_284_863_847
mas 'WaterMinder', id: 1_415_257_369
mas 'Xcode', id: 497_799_835
